const Dictionaries = {
    // 期限单位
    deadlineUnit: {
        'D': '日',
        'M': '月',
        'S': '季',
        'Y': '年'
    },
    // 还款方式
    reimbursementMeans: {
        '1': '等额本金',
        '2': '等额本息',
        '3': '定期还息，到期还本',
        '4': '到期还本付息'
    },
    // 证件类型
    certificateType: {
        '0': '身份证',
        '1': '户口簿',
        '2': '护照',
        '3': '军官证',
        '4': '士兵证',
        '5': '港澳居民来往内地通行证',
        '6': '台湾同胞来往内地通行证',
        '7': '临时身份证',
        '8': '外国人居留证',
        '9': '警官证',
        'A': '香港身份证',
        'B': '澳门身份证',
        'C': '台湾身份证',
        'X': '其他证件'
    },
    // 是否授信
    isCredit: {
        'Y': '是',
        'N': '否'
    },
    // 是否可循环
    isLoop: {
        'Y': '是',
        'N': '否'
    },
    // 贷款用途
    loanUse: {
        '1': '个人消费',
        '2': '生产经营',
        '3': '综合授信'
    },
    // 贷款种类
    loanType: {
        '11': '个人住房贷款',
        '12': '个人商用房（包括商住两用）贷款',
        '13': '个人住房公积金贷款',
        '21': '个人汽车消费贷款',
        '1': '个人助学贷款',
        '41': '个人经营性贷款',
        '51': '农户贷款',
        '71': '准贷记卡',
        '81': '贷记卡',
        '91': '个人消费贷款',
        '99': '其他'
    },
    // 担保方式
    guaranteeMode: {
        '1': '质押',
        '2': '抵押',
        '3': '保证',
        '4': '信用'
    },
    // 支付方式
    payMode: {
        '1': '自主支付',
        '2': '受托支付'
    },
    // 风险分类结果
    riskGrade: {
        '1': '正常',
        '2': '关注',
        '3': '次级',
        '4': '可疑',
        '5': '损失',
        'Y': '未知'
    },
    // 性别
    sex: {
        '0': '未知的性别',
        '1': '男性',
        '2': '女性',
        '9': '未说明性别'
    },
    // 婚姻状况
    marriage: {
        '10': '未婚',
        '20': '已婚',
        '21': '初婚',
        '22': '再婚',
        '23': '复婚',
        '30': '丧偶',
        '40': '离婚',
        '90': '未说明的婚姻状况'
    },
    // 文化程度
    highestEdu: {
        '10': '研究生',
        '20': '大学本科',
        '30': '大学专科和专科学校',
        '40': '中等专业学校或中等技术学校',
        '50': '技术学校',
        '60': '高中',
        '70': '初中',
        '80': '小学',
        '90': '文盲或半文盲',
        '99': '未知',
        '88': '博士'
    },
    // 住宅状况
    liveInfo: {
        '1': '自置',
        '2': '按揭',
        '3': '亲属楼宇',
        '4': '集体宿舍',
        '5': '租房',
        '6': '共有住宅',
        '7': '其他',
        '9': '未知'
    },
    // 现任职务
    jobLevel: {
        '1': '高级领导',
        '2': '中级领导',
        '3': '一般员工',
        '4': '其他',
        '9': '未知'
    },
    // 工作成绩
    performance: {
        '01': '优秀',
        '02': '良好',
        '03': '一般',
        '04': '较差',
        '05': '恶劣'
    },
    // 所属行业
    jobIndustry: {
        'A': '农、林、牧、渔业',
        'B': '采掘业',
        'C': '制造业',
        'D': '电力、燃气及水的生产和供应业',
        'E': '建筑业',
        'F': '交通运输、仓储和邮政业',
        'G': '信息传输、计算机服务和软件业',
        'H': '批发和零售业',
        'I': '住宿和餐饮业',
        'J': '金融业',
        'K': '房地产业',
        'L': '租赁和商务服务业',
        'M': '科学研究、技术服务业和地质勘察业',
        'N': '水利、环境和公共设施管理业',
        'O': '居民服务和其他服务业',
        'P': '教育',
        'Q': '卫生、社会保障和社会福利业',
        'R': '文化、体育和娱乐业',
        'S': '公共管理和社会组织',
        'T': '国际组织',
        'Z': '未知'
    },
    // 职业
    occupation: {
        '0': '国家机关、党群组织、企业、事业单位负责人',
        '1': '专业技术人员',
        '3': '办事人员和有关人员',
        '4': '商业、服务业人员',
        '5': '农、林、牧、渔、水利业生产人员',
        '6': '生产、运输设备操作人员及有关人员',
        'X': '军人',
        'Y': '不便分类的其他从业人员',
        'Z': '未知'
    },
    // 社会关系称谓
    custRelationShip_relawithManager: {
        '00': '父母',
        '01': '配偶',
        '02': '亲属',
        '03': '子女',
        '04': '朋友',
        '05': '师生',
        '06': '同学',
        '07': '同事',
        '10': '其他',
        '21': '开拓人',
        '22': '保证人',
        '23': '抵质押人',
        '24': '客户经理',
        '30': '法人',
        '31': '股东'
    },
    // 健康状况
    health: {
        '01': '良好',
        '02': '一般',
        '03': '差'
    },
    // 财产共有人称谓
    custAssetOwner_relawithManager: {
        '00': '父母',
        '01': '配偶',
        '02': '亲属',
        '03': '子女',
        '04': '朋友',
        '05': '师生',
        '06': '同学',
        '07': '同事',
        '10': '其他',
        '21': '开拓人',
        '22': '保证人',
        '23': '抵质押人',
        '24': '客户经理',
        '30': '法人',
        '31': '股东'
    },
    // 信用情况
    creditSituation: {
        '01': '优秀',
        '02': '良好',
        '03': '一般',
        '04': '较差',
        '05': '恶劣'
    },
    // 经营场所性质
    placeNature: {
        '1': '自有',
        '2': '租赁',
        '3': '其它'
    },
    // 经营规模
    businessScale: {
        '1': '大型企业',
        '2': '中型企业',
        '3': '小型企业',
        '4': '事业单位',
        '5': '微型企业',
        '9': '其他'
    },
    // 经营模式
    businessModel: {
        'A': '国有',
        'B': '集体',
        'C': '私营',
        'D': '个体',
        'E': '联营',
        'F': '股份制',
        'G': '外商',
        '9': '其它'
    },
    // 经营固定资产种类
    assetsType: {
        '01': '房屋',
        '02': '土地',
        '03': '交通工具',
        '04': '设备',
        '05': '凭证',
        '06': '其他',
        '10': '质押品',
        '20': '抵押品',
        '31': '基金',
        '32': '理财',
        '33': '信托',
        '34': '记账式国债',
        '35': '电子式国债',
        '36': '凭证式国债',
        '37': '三方存款'
    },
    // 库存存货种类
    stockType: {
        '01': '原材料',
        '02': '在产品',
        '03': '半成品',
        '04': '产成品',
        '05': '商品',
        '06': '周转材料',
        '07': '委托代销商品'
    },
    // 财产项目
    custAssetInfo_assetsType: {
        '01': '房屋',
        '02': '车辆',
        '03': '债券',
        '04': '股票',
        '05': '企业',
        '06': '土地',
        '07': '基金',
        '08': '理财产品',
        '10': '设备',
        '11': '存款',
        '09': '其他'
    },
    // 权属证件名称
    custAssetInfo_certifyType: {
        '01': '产权证号',
        '02': '车辆牌号',
        '04': '股票代码卡号',
        '05': '营业执照号码',
        '06': '土地证编号',
        '07': '基金账号',
        '09': '其他资产型号',
        '10': '发票',
        '11': '凭证号'
    },
    // 征信报告属主类型
    custCreditReport_reportType: {
        '1': '申请人',
        '2': '申请人配偶'
    },
    // 贷款种类
    custCreditLoan_loanType: {
        '11': '个人住房贷款',
        '12': '个人商用房（包括商住两用）贷款',
        '13': '个人住房公积金贷款',
        '21': '个人汽车消费贷款',
        '1': '个人助学贷款',
        '41': '个人经营性贷款',
        '51': '农户贷款',
        '71': '准贷记卡',
        '81': '贷记卡',
        '91': '个人消费贷款',
        '99': '其他'
    },
    // 信用评价
    creditEvaluate: {
        '1': '良好',
        '2': '一般',
        '3': '较差',
        '4': '恶劣'
    },

    // 账户属主类型
    accountOwnerType: {
        '1': '客户本人',
        '2': '客户配偶',
        '3': '其他',
    },
    // 借款人与抵质押人关系
    custMortgagorResult_relawithManager: {
        '11': '本人',
        '00': '父母',
        '01': '配偶',
        '02': '亲属',
        '03': '子女',
        '04': '朋友',
        '05': '师生',
        '06': '同学',
        '07': '同事',
        '10': '其他',
        '21': '开拓人',
        '22': '保证人',
        '23': '抵质押人',
        '24': '客户经理',
        '30': '法人',
        '31': '股东'
    },
    // 有无抵质押承诺书
    custMortgagorResult_haveBook: {
        '1': '有',
        '2': '无'
    },
    // 抵质押物是否出租
    custMortgagorResult_isRentOut: {
        '1': '是',
        '2': '否'
    },
    // 抵质押物有无财产共有人
    custMortgagorResult_haveOwner: {
        '1': '有',
        '2': '无'
    },
    // 是否取得承租人承诺
    custMortgagorResult_havePromise: {
        '1': '是',
        '2': '否'
    },
    // 对抵质押物调查方式
    custMortgagorResult_examMode: {
        '1': '现场',
        '2': '电话',
        '3': '外围'
    },
    // 抵质押物性质
    mortgageInfo_mortgageType: {
        'DY1': '房产',
        'DY2': '土地使用权（包含土地附着物）',
        'DY3': '在建工程',
        'DY4': '机器设备',
        'DY5': '其他类',
        'ZY1': '存单',
        'ZY2': '票据',
        'ZY3': '保单',
        'ZY4': '国债',
        'ZY5': '股权/股票',
        'ZY6': '其他权利'
    },
    // 权属证明
    mortgageInfo_certifyType: {
        '01': '产权证号',
        '02': '车辆牌号',
        '04': '股票代码卡号',
        '05': '营业执照号码',
        '06': '土地证编号',
        '07': '基金账号',
        '09': '其他资产型号',
        '10': '存单号码'
    },
    // 持有目的
    mortgageInfo_holdPurpose: {
        '1': '居住',
        '2': '投资',
        '3': '储蓄',
        '4': '生产经营'
    },
    // 使用状况
    mortgageInfo_holdStatus: {
        '1': '正常使用',
        '2': '闲置',
        '3': '其他'
    },
    // 查询冻结扣押情况
    mortgageInfo_frozenStatus: {
        '1': '有',
        '2': '无'
    },
    // 抵质押物状态
    mortgageInfo_mortgageStatus: {
        '1': '未入库',
        '2': '在库',
        '3': '出库',
        '4': '临时出库'
    },
    // 借款人与保证人关系
    custGuarantorResult_relawithManager: {
        '00': '父母',
        '01': '配偶',
        '02': '亲属',
        '03': '子女',
        '04': '朋友',
        '05': '师生',
        '06': '同学',
        '07': '同事',
        '10': '其他',
        '21': '开拓人',
        '22': '保证人',
        '23': '抵质押人',
        '24': '客户经理',
        '30': '法人',
        '31': '股东',
        '11': '本人'
    },
    // 有无保证承诺书
    custGuarantorResult_haveBook: {
        '1': '有',
        '2': '无'
    },
    // 保证人是否在申请表上签字
    custGuarantorResult_haveSign: {
        '1': '有',
        '2': '没有'
    },
    // 对保证人调查方式
    custGuarantorResult_examMode: {
        '1': '现场',
        '2': '电话',
        '3': '外围'
    },
    // 有无工资账户流水
    custGuarantorResult_haveWagesWater : {
        '1' : '有',
        '2' : '无'
    },

    // 是否核实保证人的职业信息
    custGuarantorResult_checkInfo : {
        '1' : '是',
        '2' : '有'
    },



};

export {Dictionaries}