const Dictionaries = {
    // 期限单位
    deadlineUnit : {
        'D' : '日',
        'M' : '月',
        'S' : '季',
        'Y' : '年'
    },
    // 还款方式
    reimbursementMeans : {
        '1' : '等额本金',
        '2' : '等额本息',
        '3' : '定期还息，到期还本',
        '4' : '到期还本付息'
    },
    // 证件类型
    certificateType : {
        '0' : '身份证',
        '1' : '户口簿',
        '2' : '护照',
        '3' : '军官证',
        '4' : '士兵证',
        '5' : '港澳居民来往内地通行证',
        '6' : '台湾同胞来往内地通行证',
        '7' : '临时身份证',
        '8' : '外国人居留证',
        '9' : '警官证',
        'A' : '香港身份证',
        'B' : '澳门身份证',
        'C' : '台湾身份证',
        'X' : '其他证件'
    },
    // 是否授信
    isCredit : {
        'Y' : '是',
        'N' : '否'
    },
    // 是否可循环
    isLoop : {
        'Y' : '是',
        'N' : '否'
    },
    // 贷款用途
    loanUse : {
        '1' : '个人消费',
        '2' : '生产经营',
        '3' : '综合授信'
    },
    // 贷款种类
    loanType : {
        '11' : '个人住房贷款',
        '12' : '个人商用房（包括商住两用）贷款',
        '13' : '个人住房公积金贷款',
        '21' : '个人汽车消费贷款',
        '1' : '个人助学贷款',
        '41' : '个人经营性贷款',
        '51' : '农户贷款',
        '71' : '准贷记卡',
        '81' : '贷记卡',
        '91' : '个人消费贷款',
        '99' : '其他'
    },

    // 担保方式
    guaranteeMode : {
        '1' : '质押',
        '2' : '抵押',
        '3' : '保证',
        '4' : '信用'
    },
    // 支付方式
    payMode : {
        '1' : '自主支付',
        '2' : '受托支付'
    },
    // 风险分类结果
    riskGrade : {
        '1' : '正常',
        '2' : '关注',
        '3' : '次级',
        '4' : '可疑',
        '5' : '损失',
        'Y' : '未知'
    },
};

export { Dictionaries }